# Homework-2

## Part 1, Working with Numpy
    Your goal is to calculate the final grade for studnets in a class. 
      1. We have 10 Students in class, and 5 assessment score ( Homework, Project, Exam1, Exam2, Final Exam)for each
      student. Create a matrix containing grades of students, (rows are students, columns are assessments). Use for loop and input  function for entering the student name and grades. Enter arbitary grades from 0 to 100 for each assessment 
        2. Create a weigth vector containing weight of each assessment. Example (15%, 15%, 20%, 20%, 30% )
        3. Calculate the final grade for each students. Use Numpy to create your vector, matrix and calculating final grade.
        4. Convert final grades to letter format(90%-100% = A, 80%-89% = B, 70%-79% =C, 60%-69%=D and F for less than 60% )
        5. print out Student names and their grades

## Part 2, Working with Pandas

    - Step 1: Download the titanic.csv file from github.


    - Step 2: Read the file in Python and store it in a dataframe.


    - Step 3: Explore the data in your Jupyter notebook, eg. general info about data, some basic stats.
      Also print out the data for row index 100-105 and columns 'Name', 'Age', 'Fare'


    - Step 4: Create two dataframes, one containing data for only Categorical Variables and one for only Quantitative variable
  
    - Step 5: Write these newly created dataframe in .csv files.

## Part 1) Working With Numpy:

In [160]:
#import numpy
import numpy as np

In [161]:
# make a list of student names. Kept getting errors when I tried to make the empty list and then append this into it.
names = (input(f'Type Student Names, Separated by Coma: ').split(','))
print(names)
num_stu = int(len(names))
#print(num_stu)

Type Student Names, Separated by Coma:  Al,Bob,Carol,Dylan,Evie,Freddie,Georgie,Hari,Ives,Jamie

['Al', 'Bob', 'Carol', 'Dylan', 'Evie', 'Freddie', 'Georgie', 'Hari', 'Ives', 'Jamie']

In [162]:
grades = np.empty((0,5),float)
print(grades)

[]

In [163]:
for i in range(num_stu):
    scores = input(f'type {names[i]} Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma').split(',')
    scores = [float(scores[0]), float(scores[1]), float(scores[2]), float(scores[3]), float(scores[4])]
    new_row = np.array(scores)
    #print(new_row)
    grades = np.append(grades, [new_row], axis = 0)
print(grades)

type Al Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 71,72,73,74,75
type Bob Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 81,82,83,84,85
type Carol Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 91,92,93,94,95
type Dylan Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 61,62,63,64,65
type Evie Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 81,86,95,87,95
type Freddie Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 74,75,71,63,98
type Georgie Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 85,86,96,82,91.5
type Hari Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 71,75,73,85.5,90,
type Ives Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 94,96,65,82,85,88
type Jamie Homework, Project, Exam1, Exam2,, and Final Exam grades, separated by comma 86.5,84,86,79,69

[[71.  72.  73.  74.  75. ]
 [81.  82.  83.  84.  85. ]
 [91.  92.  93.  94.  95. ]
 [61.  62.  63.  64.  65. ]
 [81.  86.  95.  87.  95. ]
 [74.  75.  71.  63.  98. ]
 [85.  86.  96.  82.  91.5]
 [71.  75.  73.  85.5 90. ]
 [94.  96.  65.  82.  85. ]
 [86.5 84.  86.  79.  69. ]]

In [164]:
# weight vector
weight = np.array([.15,.15,.20,.20,.30])
print(weight)

[0.15 0.15 0.2  0.2  0.3 ]

In [165]:
# calculate final grade via dot product
final_grade = np.dot(grades, weight)
print(final_grade)

[73.35  83.35  93.35  63.35  89.95  78.55  88.7   80.6   83.4   79.275]

In [166]:
# convert to letter grade
letter = []
for i in final_grade:
    if i >= 90:
        letter.append('A')
    elif i >= 80:
        letter.append('B')
    elif i >= 70:
        letter.append('C')
    elif i >= 60:
        letter.append('D')
    else:
        letter.append('F')

print(letter)

['C', 'B', 'A', 'D', 'B', 'C', 'B', 'B', 'B', 'C']

In [143]:
# Printed the Class Summary as a Matrix and looke VERY Ugly. 
#summary = ([names],[letter])
#summary_ar = np.array(summary)
#final_summary =summary_ar.T
#print('Class Summary')
#print(final_summary)

Class Summary
[[['Al' 'C']]

 [[' Bob' 'B']]

 [[' Carol' 'A']]]

In [157]:
#letter = list(letter)
#names = list(names)

['Al', ' Bob', ' Carol']
['C', 'B', 'A']

## Part 1 Output

In [167]:
# a much much nicer looking output
print('Class Summary\n Name\t Grade')
for i in range(num_stu):
    print(f'{names[i]}\t {letter[i]}')

Class Summary
 Name	 Grade
Al	 C
Bob	 B
Carol	 A
Dylan	 D
Evie	 B
Freddie	 C
Georgie	 B
Hari	 B
Ives	 B
Jamie	 C

## Part 2) Working with Pandas

In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
print(df.loc[100:105,['Name', 'Age', 'Fare']])

                                 Name   Age     Fare
100            Petranec, Miss Matilda  28.0   7.8958
101  Petroff, Mr. Pastcho ("Pentcho")   NaN   7.8958
102         White, Mr. Richard Frasar  21.0  77.2875
103        Johansson, Mr. Gustaf Joel  33.0   8.6542
104    Gustafsson, Mr. Anders Vilhelm  37.0   7.9250
105             Mionoff, Mr. Stoytcho  28.0   7.8958

categorical: PassengerID (nominal), Pclass (ordinal),Survived (binary yes/no-nominal), Name, Sex, Ticket (nominal) Cabin, Embarked
quantitative: Age, SibSp, Parch, Fare

In [14]:
cat = df[['PassengerId','Survived', 'Pclass', 'Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']]
cat.head()
quant = df[['Age', 'SibSp', 'Parch', 'Fare']]
quant.head()

    Age  SibSp  Parch     Fare
0  22.0      1      0   7.2500
1  38.0      1      0  71.2833
2  26.0      0      0   7.9250
3  35.0      1      0  53.1000
4  35.0      0      0   8.0500

In [15]:
cat.to_csv('catagorical_titanic_variables.csv')
quant.to_csv('quantitative_titanic_variables.csv')